In [374]:
import numpy as np # Lineat algebra 
import pandas as pd # Data processing

Loading the file_1 for data cleaning

In [375]:
data = pd.read_csv("C:/Users/HP/Documents/Prepinsta/Week 3/Week3_Assignement_1/Assignment_1.csv")

-head()
-tail()
-info()
-dtypes
-describe()
-smaple(3)
-shape

In [376]:
data.head() # used to saw the top 5 rows of the data.

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [377]:
data.tail() # used to saw the bottom 5 rows of the data

    Index   Age     Salary  Rating       Location  Established Easy Apply
24     24  13.0  $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0  $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN  $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0  $44k-$99k     5.4       India,In         1935         -1
28     28   NaN  $39k-$88k     3.4  Australia Aus         1932         -1

In [378]:
data.info() # Gives the info/summary about the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

In [379]:
data.dtypes # column wise data type

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [380]:
data.describe()

           Index        Age     Rating  Established
count  29.000000  22.000000  28.000000    29.000000
mean   14.000000  39.045455   3.528571  1638.620690
std     8.514693  16.134781   2.825133   762.079599
min     0.000000  13.000000  -1.000000    -1.000000
25%     7.000000  25.000000   1.050000  1935.000000
50%    14.000000  39.500000   4.200000  1984.000000
75%    21.000000  50.000000   5.400000  1999.000000
max    28.000000  66.000000   7.800000  2020.000000

In [381]:
data1 = data.isna().sum() # Column wise null values 
print(data1)
data2 = data.isna().sum().sum()
print('Total No. of empty values: ',data2)

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64
Total No. of empty values:  8

#List of all coloumn

In [382]:
data.columns

Index(['Index', 'Age', 'Salary', 'Rating', 'Location', 'Established',
       'Easy Apply'],
      dtype='object')

In [383]:
#Fix all the column names(Convert all the columns names in lower case)
#It is convenient to convert all the column names in lower case.

data.columns = data.columns.str.lower()
data.columns

Index(['index', 'age', 'salary', 'rating', 'location', 'established',
       'easy apply'],
      dtype='object')

In [384]:
# We want no gap between tha column names. Eg easy apply Convert this into easy_apply
data.columns = data.columns.str.replace(' ','_')
data.columns

Index(['index', 'age', 'salary', 'rating', 'location', 'established',
       'easy_apply'],
      dtype='object')

Call a coloumn

In [385]:
data[['age','salary']].head()
#data.age

    age     salary
0  44.0  $44k-$99k
1  66.0  $55k-$66k
2   NaN  $77k-$89k
3  64.0  $44k-$99k
4  25.0  $44k-$99k

# Age

In [386]:
#data.age.isna().sum()
null_age = data['age'].isna().sum()# Do age column contain any null cell
print('Total empty cells in age colummn:',null_age)

Total empty cells in age colummn: 7

In [387]:
# Filling the empty cell with mean(average) 
avg_age = data.age.mean()
data.age = data.age.fillna(avg_age)
print(data.age)
print()
print('Empty cells in age column:',data.age.isna().sum())

0     44.000000
1     66.000000
2     39.045455
3     64.000000
4     25.000000
5     44.000000
6     21.000000
7     44.000000
8     35.000000
9     22.000000
10    55.000000
11    44.000000
12    39.045455
13    25.000000
14    66.000000
15    44.000000
16    19.000000
17    39.045455
18    35.000000
19    32.000000
20    39.045455
21    35.000000
22    19.000000
23    39.045455
24    13.000000
25    55.000000
26    39.045455
27    52.000000
28    39.045455
Name: age, dtype: float64

Empty cells in age column: 0

In [388]:
data.age = data.age.round(1)
data.age.head()

0    44.0
1    66.0
2    39.0
3    64.0
4    25.0
Name: age, dtype: float64

Convert the column age from flot to integer

In [389]:
data['age'] = data['age'].astype(int)
data.age.head()

0    44
1    66
2    39
3    64
4    25
Name: age, dtype: int32

# Salary column

In [390]:
data['salary'].head()

0    $44k-$99k
1    $55k-$66k
2    $77k-$89k
3    $44k-$99k
4    $44k-$99k
Name: salary, dtype: object

#Remove the $ sign

In [391]:
data['salary'] = data['salary'].apply(lambda x:x.replace('$',''))
data['salary'] = data['salary'].apply(lambda x:x.replace('k',''))
data['salary'].head()

0    44-99
1    55-66
2    77-89
3    44-99
4    44-99
Name: salary, dtype: object

# Rating

In [392]:
data.head()

   index  age salary  rating       location  established easy_apply
0      0   44  44-99     5.4       India,In         1999       TRUE
1      1   66  55-66     3.5    New York,Ny         2002       TRUE
2      2   39  77-89    -1.0    New York,Ny           -1         -1
3      3   64  44-99     4.4       India In         1988         -1
4      4   25  44-99     6.4  Australia Aus         2002         -1

Remove the negetive sign from the rating column

In [393]:
# data.rating = data['rating'].apply(lambda x:x.replace('-','')) ?  WHY WE CAN'T USE THIS

# Replacing special character with nan values  
data.rating.replace((-1,np.nan),inplace=True) # Replace the -1 values with nan 
data.rating.fillna(data.rating.mean(),inplace=True) # fill the nan values with mean age 
data.rating.head()

0    5.4
1    3.5
2    3.5
3    4.4
4    6.4
Name: rating, dtype: float64

# Location

In [394]:
data.location.astype

<bound method NDFrame.astype of 0          India,In
1       New York,Ny
2       New York,Ny
3          India In
4     Australia Aus
5          India,In
6       New York,Ny
7     Australia Aus
8       New York,Ny
9          India,In
10         India,In
11         India,In
12         India,In
13    Australia Aus
14    Australia Aus
15    Australia Aus
16         India,In
17      New York,Ny
18      New York,Ny
19      New York,Ny
20      New York,Ny
21      New York,Ny
22      New York,Ny
23      New York,Ny
24      New York,Ny
25    Australia Aus
26         India,In
27         India,In
28    Australia Aus
Name: location, dtype: object>

In [395]:
data.location.dtypes

dtype('O')

Cleaning the location column and spliting the city from the city short name

In [396]:
data.location = data.location.str.replace('Australia Aus','Australia,Aus')
data.location = data.location.str.replace('India In','India,In')
data['location_city'] = data['location'].str.split(',',expand=True).get(0) # This creates a new column with name of location_city 
data['location_sign'] = data.location.str.split(',',expand=True).get(1)    # # This creates a new column with name of location_sign
data.head()

,index,age,salary,rating,location,established,easy_apply,location_city,location_sign
0,0,44,44-99,5.4,"India,In",1999,TRUE,India,In
1,1,66,55-66,3.5,"New York,Ny",2002,TRUE,New York,Ny
2,2,39,77-89,3.5,"New York,Ny",-1,-1,New York,Ny
3,3,64,44-99,4.4,"India,In",1988,-1,India,In
4,4,25,44-99,6.4,"Australia,Aus",2002,-1,Australia,Aus

Now drop the location column

In [397]:
data = data.drop('location',axis=1)
data.head() # here axis=1 means the operation is performed alongside of the column

,index,age,salary,rating,established,easy_apply,location_city,location_sign
0,0,44,44-99,5.4,1999,TRUE,India,In
1,1,66,55-66,3.5,2002,TRUE,New York,Ny
2,2,39,77-89,3.5,-1,-1,New York,Ny
3,3,64,44-99,4.4,1988,-1,India,In
4,4,25,44-99,6.4,2002,-1,Australia,Aus

# eastablished

In [398]:
data.established.astype

<bound method NDFrame.astype of 0     1999
1     2002
2       -1
3     1988
4     2002
5     1999
6       -1
7       -1
8       -1
9       -1
10    2008
11    2009
12    1999
13    2019
14    2020
15    1999
16    1984
17    1943
18    1954
19    1955
20    1944
21    1946
22    1988
23    1999
24    1987
25    1980
26    1934
27    1935
28    1932
Name: established, dtype: int64>

In [399]:
data.established = data.established.replace(-1,np.nan)
data.established.fillna('Unknown',inplace=True)
data.established.head()

0     1999.0
1     2002.0
2    Unknown
3     1988.0
4     2002.0
Name: established, dtype: object

# easy_apply

In [400]:
#data['easy_apply'] = data['easy_apply'].apply(lambda x:x.replace('-1','False'))
data.easy_apply = data.easy_apply.replace('-1','False')
data.easy_apply.head()

0     TRUE
1     TRUE
2    False
3    False
4    False
Name: easy_apply, dtype: object

# Now Our data is clean

In [401]:
data

,index,age,salary,rating,established,easy_apply,location_city,location_sign
0,0,44,44-99,5.4,1999.0,TRUE,India,In
1,1,66,55-66,3.5,2002.0,TRUE,New York,Ny
2,2,39,77-89,3.5,Unknown,False,New York,Ny
3,3,64,44-99,4.4,1988.0,False,India,In
4,4,25,44-99,6.4,2002.0,False,Australia,Aus
5,5,44,77-89,1.4,1999.0,TRUE,India,In
6,6,21,44-99,0.0,Unknown,False,New York,Ny
7,7,44,44-99,0.0,Unknown,False,Australia,Aus
8,8,35,44-99,5.4,Unknown,False,New York,Ny
9,9,22,44-99,7.7,Unknown,TRUE,India,In
10,10,55,10-49,5.4,2008.0,TRUE,India,In
11,11,44,10-49,6.7,2009.0,False,India,In
12,12,39,44-99,0.0,1999.0,False,India,In
13,13,25,44-99,0.0,2019.0,TRUE,Australia,Aus
14,14,66,44-99,4.0,2020.0,TRUE,Australia,Aus
15,15,44,88-101,3.0,1999.0,False,Australia,Aus
16,16,19,19-40,4.5,1984.0,False,India,In
17,17,39,44-99,5.3,1943.0,TRUE,New York,Ny
18,18,35,44-99,6.7,1954.0,TRUE,New York,Ny
19,19,32,44-99,3.3,1955.0,TRUE,New York,Ny
20,20,39,44-99,5.7,1944.0,TRUE,New York,Ny
21,21,35,44-99,5.0,1946.0,False,New York,Ny
22,22,19,55-66,7.8,1988.0,TRUE,New York,Ny
23,23,39,44-99,2.4,1999.0,TRUE,New York,Ny
24,24,13,44-99,2.4,1987.0,False,New York,Ny
25,25,55,44-99,0.0,1980.0,TRUE,Australia,Aus
26,26,39,55-66,0.0,1934.0,TRUE,India,In
27,27,52,44-99,5.4,1935.0,False,India,In
28,28,39,39-88,3.4,1932.0,False,Australia,Aus

# Data 2

Load Data

In [402]:
# Read the tsv file 
df = pd.read_csv("C:/Users/HP/Documents/Prepinsta/Week 3/Week3_Assignement_1/Assignemnt_2.tsv",sep='\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [403]:
df.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [404]:
df.shape

(4622, 5)

Data type of each column

In [405]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [406]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [407]:
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [408]:
df.columns # here all columns are in small letter and no space between them column names.

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [409]:
df_1= df.isna().sum()
print(df_1)
df_2 = df.isna().sum().sum()
print('Total No. of null values:',df_2)

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64
Total No. of null values: 1246

# Choice Description

In [410]:
df.choice_description.head()

0                                                  NaN
1                                         [Clementine]
2                                              [Apple]
3                                                  NaN
4    [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
Name: choice_description, dtype: object

In [411]:
#df.fillna('Unknown',inplace=True)
#df.head()

In [412]:
#df = df['choice_description'].str.replace('[','')
#df = df.choice_description.str.replace(']','')
#df.head()
#df = df.choice_description.str.replace(']','')

# Questions

Q1. Quantity of each item.

In [413]:
c = df.groupby('item_name').sum()
c = c.sort_values(['quantity'],ascending = False)
c.head().iloc[:,0:2] #Shows the first 3 columns

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

Q2. What was the most oredered item in the *choice_description* column.

In [414]:
c = df.groupby('choice_description').sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1).iloc[:,0:2]

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

Q3. How many items were ordered

In [415]:
total_items_ordered = df.quantity.sum()
print('Total items ordered are:',total_items_ordered)

Total items ordered are: 4972

In [416]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

## Turn the items price into float

In [417]:
df.item_price.head()

0     $2.39
1     $3.39
2     $3.39
3     $2.39
4    $16.98
Name: item_price, dtype: object

#Remove the dollar sign

In [418]:
df.item_price = df.item_price.str.replace('$','').astype(float)
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

Q4. How much was the revenue for the period in the dataset?

In [419]:
revenue = df.item_price.sum()
print('Revenue for the period in the dataset:  $',revenue)

Revenue for the period in the dataset:  $ 34500.16

Q5. How many orders were made in the period?

In [420]:
orders = df.order_id.value_counts().count() # value_count -> It counts the occurrences of each unique value in the specified column. In this case, it's counting how many times each unique order_id appears in the DataFrame.
print('Numbers of orders made in the period:',orders)

Numbers of orders made in the period: 1834

Q6. What is the average revenue amount per order?

In [425]:
df['revenue'] = df['quantity'] * df['item_price']
d = df.groupby('order_id').sum()
average_revenue = d.revenue.mean().round(2)
print('Average revenue per order:  $',average_revenue)

Average revenue per order:  $ 21.39

Q7. How many differrent items are sold ?

In [426]:
df_item = df.item_name.value_counts().count()
print('Differnet items solds are:  $',df_item)

Differnet items solds are:  $ 50